**Missing Value Analysis**

In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {'Name': ['Ram','Sita','Laxman',np.nan],
        'Age': [30,31,np.nan,33],
'city': [np.nan,'Hyd','Pune','Chennai']}
pd.DataFrame(dict1)

     Name   Age     city
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai

In [3]:
df = pd.DataFrame(dict1)
df

     Name   Age     city
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai

$Method-1$:
**Fill with a random number to all null values**

In [5]:
df.isnull()   # where ever null values are there it shows as True

    Name    Age   city
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [6]:
df.isnull().sum()

Name    1
Age     1
city    1
dtype: int64

In [7]:
df.fillna(40)

     Name   Age     city
0     Ram  30.0       40
1    Sita  31.0      Hyd
2  Laxman  40.0     Pune
3      40  33.0  Chennai

In [14]:
df

     Name   Age     city
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai

In [16]:
df.fillna(40,inplace = True)  # inplace = True    it means it is updating the values to the dataframe

In [18]:
df

     Name   Age     city
0     Ram  30.0       40
1    Sita  31.0      Hyd
2  Laxman  40.0     Pune
3      40  33.0  Chennai

In [20]:
df.dtypes

Name     object
Age     float64
city     object
dtype: object

$Method-2$:

**Fill the Random values by using column wise**

In [24]:
########################   Read the data again     ###############################
dict1 = {'Name': ['Ram','Sita','Laxman',np.nan],
        'Age': [30,31,np.nan,33],
'city': [np.nan,'Hyd','Pune','Chennai']}
pd.DataFrame(dict1)

     Name   Age     city
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai

In [26]:
#  when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)'   (error message)
dict1 = {'Name': ['Ram','Sita','Laxman',np.nan],
        'Age': [30,31,np.nan,33],
'city': [np.nan,'Hyd','Pune','Chennai']}
pd.DataFrame(dict1)

     Name   Age     city
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai

In [28]:
df = pd.DataFrame(dict1)
df

     Name   Age     city
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai

In [30]:
df['Name'] = df['Name'].fillna('Raheem')
df['Age'] = df['Age'].fillna(32)
df['city'] = df['city'].fillna('Blr')
df

     Name   Age     city
0     Ram  30.0      Blr
1    Sita  31.0      Hyd
2  Laxman  32.0     Pune
3  Raheem  33.0  Chennai

$Method-3$:
- Pad
- bfill
- backfill
- ffill

In [33]:
########################   Read the data again     ###############################
dict1 = {'Name': ['Ram','Sita','Laxman',np.nan],
        'Age': [30,31,np.nan,33],
'city': [np.nan,'Hyd','Pune','Chennai']}
df = pd.DataFrame(dict1)

In [35]:
df

     Name   Age     city
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai

**Pad**

In [38]:
print('============   Original   =============')
print(df)
print('================Pad===============')
print(df.fillna(method = 'pad'))

============   Original   =============
     Name   Age     city
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai
================Pad===============
     Name   Age     city
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman  31.0     Pune
3  Laxman  33.0  Chennai

C:\Users\Kishan D K\AppData\Local\Temp\ipykernel_9764\279738509.py:4: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df.fillna(method = 'pad'))

**bfill**

In [41]:
print('============   Original   =============')
print(df)
print('================bfill===============')
print(df.fillna(method = 'bfill'))

============   Original   =============
     Name   Age     city
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai
================bfill===============
     Name   Age     city
0     Ram  30.0      Hyd
1    Sita  31.0      Hyd
2  Laxman  33.0     Pune
3     NaN  33.0  Chennai

C:\Users\Kishan D K\AppData\Local\Temp\ipykernel_9764\223943731.py:4: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df.fillna(method = 'bfill'))

**backfill**

In [44]:
print('============   Original   =============')
print(df)
print('================backfill===============')
print(df.fillna(method = 'backfill'))

============   Original   =============
     Name   Age     city
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai
================backfill===============
     Name   Age     city
0     Ram  30.0      Hyd
1    Sita  31.0      Hyd
2  Laxman  33.0     Pune
3     NaN  33.0  Chennai

C:\Users\Kishan D K\AppData\Local\Temp\ipykernel_9764\2323434287.py:4: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df.fillna(method = 'backfill'))

In [46]:
print('============   Original   =============')
print(df)
print('================ffill===============')
print(df.fillna(method = 'ffill'))

============   Original   =============
     Name   Age     city
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai
================ffill===============
     Name   Age     city
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman  31.0     Pune
3  Laxman  33.0  Chennai

C:\Users\Kishan D K\AppData\Local\Temp\ipykernel_9764\3622858625.py:4: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df.fillna(method = 'ffill'))

$Method-4$:
- Mean
- Median
- Mode

In [49]:
########################   Read the data again     ###############################
dict1 = {'Name': ['Ram','Sita','Laxman',np.nan],
        'Age': [30,31,np.nan,33],
'city': [np.nan,'Hyd','Pune','Chennai']}
pd.DataFrame(dict1)

     Name   Age     city
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai

In [59]:
mean_age = df['Age'].mean()
df['Age'].fillna(mean_age)

0    30.000000
1    31.000000
2    31.333333
3    33.000000
Name: Age, dtype: float64

In [61]:
median_age = df['Age'].median()
df['Age'].fillna(median_age)

0    30.0
1    31.0
2    31.0
3    33.0
Name: Age, dtype: float64

- Mean and median is used for numerical data
- Mode is used for categorical data